{"data": {"products":[{"name":"Disclaimer !!","desc":"The content of this app is provided for information purposes only.\n\nThe public (open) data available in this app is intended to be general reference source.]\n\nUsers are encouraged to check with the individual bank before making any financial decision.\n\n❗❗ The Developer of the app does not guarantee, and accepts no legal liability whatsoever arising from, or connected to, the use of any material contained in this app."},{"name":"ANZ - Product's !\nResidential Mortgages","desc":"Thank you for using `my Bank-AU` app ♥  .\n\nThis data was last updated on :\n26 May 2021\n\nTo know more about open banking in Australia, visit :\n\nhttps://treasury.gov.au/consumer-data-right."},{"name":"ANZ Equity Manager (with Breakfree Package)","desc":"Line of credit secured by your property. Bundle your home loan, everyday account and credit card into an ANZ Breakfree package with ongoing benefits and discounts."},{"name":"ANZ Fixed Loan (with Breakfree Package)","desc":"The certainty of fixed repayments. Bundle your home loan, everyday account and credit card into an ANZ Breakfree package with ongoing benefits and discounts"},{"name":"ANZ Standard Variable Loan (with Breakfree Package)","desc":"The flexibility you need. Bundle your home loan, everyday account and credit card into an ANZ Breakfree package with ongoing benefits and discounts."},{"name":"ANZ Fixed Loan (without Breakfree Package)","desc":"The certainty of fixed repayments"},{"name":"ANZ Equity Manager (without Breakfree Package)","desc":"Line of credit that helps you turn the equity in your home into money you can actually use. You'll be able to access it any time, just like an everyday banking account."},{"name":"ANZ Simplicity PLUS Loan","desc":"If you want a competitive variable rate loan and you only need basic features, consider ANZ Simplicity PLUS. It's a simple loan with no monthly fee that still gives you the flexibility to make extra repayments to pay it off sooner."},{"name":"ANZ Standard Variable Loan (without Breakfree Package)","desc":"The flexibility you need. Bundle your home loan, everyday account and credit card into an ANZ Breakfree package with ongoing benefits and discounts."}]},"size": "9"}