{"data": {"products":[{"name":"Disclaimer !!","desc":"The content of this app is provided for information purposes only.\n\nThe public (open) data available from this app is intended as a general reference source. Users are encouraged to check with the individual bank to make any financial decision.\n\nThe Developer of the app does not guarantee, and accepts no legal liability whatsoever arising from, or connected to, the use of any material contained in this app."},{"name":"ANZ - Product's !\nTrans And Savings Accounts","desc":"Thank you for using `my Bank-AU` app.\n\nThis data was last updated on : Apr 25, 2021\n\nTo know more about open banking in Australia, visit:\n\nhttps://treasury.gov.au/consumer-data-right"},{"name":"ANZ Cash Investment Account","desc":"A simple account that lets you transact, trade and settle with your own cash."},{"name":"ANZ SMSF Cash Hub Account","desc":"Self managed super is easier than ever, with all you need to use, move and manage your SMSF cash in one place."},{"name":"ANZ V2 PLUS","desc":"Distributed via a range of approved Third Parties such as stockbrokers, accountants and SMSF administrators who open deposit accounts on behalf of their customers"},{"name":"ANZ Online Saver","desc":"An online savings account"},{"name":"ANZ Progress Saver","desc":"Savings account where can earn bonus interest for saving regularly"},{"name":"Farm Management Deposit Fixed Term","desc":"A tax efficient investment account for primary producers that can help you manage uneven cashflow"},{"name":"ANZ Business Extra","desc":"An everyday business account offering greater flexibility and control through ANZ Internet Banking for Business"},{"name":"ANZ Business Advantage","desc":"A simple, low-cost business account that gives you easy access to your money via ANZ Internet banking, ATMs and branches."},{"name":"Farm Management Deposit At Call","desc":"A tax efficient investment account for primary producers that can help you manage uneven cashflow"},{"name":"ANZ Business Online Saver","desc":"Online business investment account that's linked to your everyday account"},{"name":"ANZ Access Basic","desc":"Offers affordable and convenient banking for Concession and Health Care card holders."},{"name":"ANZ Pensioner Advantage Account","desc":"Basic account for recipients of eligible Centrelink or Veterans' Affairs pension or allowance"},{"name":"ANZ Premium Cash Management Account","desc":"An interest bearing product that offers flexible transactional capabilities"},{"name":"ANZ One Offset Account","desc":"Reduce interest charges and pay your loan off sooner."},{"name":"ANZ Access Advantage","desc":"An everyday account with easy and secure banking, unlimited ANZ Transactions and Visa Debit card"}]},"size": "17"}