{"data": {"products":[{"name":"Disclaimer !!","desc":"The content of this app is provided for information purposes only.\n\nThe public (open) data available from this app is intended as a general reference source. Users are encouraged to check with the individual bank to make any financial decision.\n\nThe Developer of the app does not guarantee, and accepts no legal liability whatsoever arising from, or connected to, the use of any material contained in this app."},{"name":"NAB - Product's !\nCred And Chrg Cards","desc":"Thank you for using `my Bank-AU` app.\n\nThis data was last updated on : Apr 25, 2021\n\nTo know more about open banking in Australia, visit:\n\nhttps://treasury.gov.au/consumer-data-right"},{"name":"NAB Low Rate Card","desc":"Our lowest interest rate on purchases with no frills"},{"name":"NAB Qantas Rewards Premium Card","desc":"Earn Qantas Points and enjoy platinum services and complimentary insurances"},{"name":"Qantas Business Signature Card","desc":"Get more from your business credit card purchases. Maximise your Qantas Points."},{"name":"NAB Low Fee Platinum Card","desc":"Our lowest annual fee card with platinum services and complimentary insurances"},{"name":"NAB Business Card","desc":"Manage your employee's business expenses by giving them their own charge card."},{"name":"NAB StraightUp Card","desc":"No interest, late payment fees or foreign currency fees, just a simple monthly fee."},{"name":"NAB Qantas Rewards Signature Card","desc":"The Qantas Rewards Signature card gives customers the opportunity to be rewarded for the purchases they make by earning Qantas Frequent Flyer points at the fastest rate.\r\nIncludes Signature benefits, including complimentary insurances."},{"name":"NAB Low Rate Business Card","desc":"If you’re a small business, our low rate business credit card can help you manage your cash flow."},{"name":"NAB Rewards Platinum Card","desc":"Earn NAB Rewards Points and enjoy platinum services and complimentary insurances"},{"name":"NAB Rewards Signature Card","desc":"Our highest NAB Rewards Points earn rate with platinum services and complimentary insurances"},{"name":"NAB Low Fee Card","desc":"Our lowest annual fee card with no frills"},{"name":"NAB Rewards Business Signature Card","desc":"With a business credit card, earn and redeem NAB Rewards Points."}]},"size": "14"}