{"data": {"products":[{"name":"Disclaimer !!","desc":"The content of this app is provided for information purposes only.\n\nThe public (open) data available in this app is intended to be general reference source.]\n\nUsers are encouraged to check with the individual bank before making any financial decision.\n\n❗❗ The Developer of the app does not guarantee, and accepts no legal liability whatsoever arising from, or connected to, the use of any material contained in this app."},{"name":"ANZ - Product's !\nCred And Chrg Cards","desc":"Thank you for using `my Bank-AU` app ♥  .\n\nThis data was last updated on :\n26 May 2021\n\nTo know more about open banking in Australia, visit :\n\nhttps://treasury.gov.au/consumer-data-right."},{"name":"ANZ First","desc":"A simple everyday credit card with a low ongoing annual fee"},{"name":"ANZ Rewards Travel Adventures","desc":"Get ready for your next adventure with the credit card that gets you travelling"},{"name":"ANZ Frequent Flyer Black","desc":"Our most rewarding Qantas experience"},{"name":"ANZ Platinum","desc":"A simple everyday credit card with $0 annual fee in the first year and complimentary insurances (conditions and exclusions apply)"},{"name":"ANZ Rewards Black","desc":"Our highest Reward Points earning potential"},{"name":"ANZ Rewards","desc":"Be rewarded for your everyday purchases and have the flexibility to redeem points for rewards ranging from gift cards to cashback and travel"},{"name":"ANZ Low Rate","desc":"A credit card with a low ongoing interest rate for your everyday purchases"},{"name":"ANZ Frequent Flyer Platinum","desc":"Earn Qantas Points on everyday purchases with complimentary insurances (conditions and exclusions apply) and Personal Concierge"},{"name":"ANZ Frequent Flyer","desc":"Earn Qantas Points on your everyday purchases"},{"name":"ANZ Rewards Platinum","desc":"Be rewarded for your everyday purchases and access a flexible Rewards program with complimentary insurances (conditions and exclusions apply) and Personal Concierge"},{"name":"ANZ Business Rewards Options","desc":"A credit card facility for businesses where you can earn rewards on eligible transactions"},{"name":"ANZ Business Black","desc":"A credit card facility for businesses where you can earn rewards on eligible transactions and receive overseas travel and medical insurance"},{"name":"ANZ Visa Purchasing & Corporate Cards","desc":"Credit cards to manage business purchases and expenses"},{"name":"ANZ Business Low Rate","desc":"A credit card facility for businesses with a low interest ongoing interest rate"},{"name":"ANZ Business 55 Interest Free Days","desc":"A credit card facility for businesses with up to 55 days interest free on purchases (if you pay your closing balance in full by the due date each month)"}]},"size": "17"}