{"data": {"products":[{"name":"Disclaimer !!","desc":"The content of this app is provided for information purposes only.\n\nThe public (open) data available from this app is intended as a general reference source. Users are encouraged to check with the individual bank to make any financial decision.\n\nThe Developer of the app does not guarantee, and accepts no legal liability whatsoever arising from, or connected to, the use of any material contained in this app."},{"name":"CBA - Product's !\nCred And Chrg Cards","desc":"Thank you for using `my Bank-AU` app.\n\nThis data was last updated on : Apr 25, 2021\n\nTo know more about open banking in Australia, visit:\n\nhttps://treasury.gov.au/consumer-data-right"},{"name":"Corporate Low Rate card","desc":"Designed for medium businesses wishing to manage their cash flow by paying down larger items over time. Options to monitor employee expenses, set limits and access expense reports in order to minimise costs."},{"name":"Corporate Interest Free Days card","desc":"Designed for medium to large businesses wanting to maximise cash flow with interest free days on purchases, monitor employee expenses, set transaction limits and access expense reports in order to track, analyse and forecast expenses."},{"name":"Corporate charge card","desc":"Ideal for large organisations with significant expenses. You can set spending limits and access expense reports to monitor spending and forecast costs."},{"name":"Virtual Cards","desc":"Virtual Cards are a streamlined travel and procurement management solution, which provides large businesses the ability to take advantage of extended payment terms, transaction level payment security, and transaction level data through the deployment of single-use virtual cards."},{"name":"Procurement Management Account","desc":"A Procurement Management Account is a corporate card 'account' (16 digit card number) assigned to an organisation or business unit, which allows multiple authorised users to transact on the account. It is primarily used for a large volume of transactions (e.g. high volumes of travel bookings) or high value procurement transactions (e.g. strategic suppliers)."},{"name":"Diamond Awards credit card","desc":"A credit card that rewards your everyday spend, where you can earn up to 1 million points per year with the added benefit of international travel insurance."},{"name":"Low Rate credit card","desc":"With a low interest rate on purchases, our Low Rate credit card makes it easier to pay off purchases over time."},{"name":"Low Rate Gold credit card","desc":"Stay in control of your finances with our low purchase interest rate, plus handy extras like international travel insurance."},{"name":"Low Fee credit card","desc":"Enjoy the flexibility and convenience of a credit card with a low annual fee."},{"name":"Low Fee Gold","desc":"Enjoy the flexibility and convenience of a credit card with no annual fee in the first year and included international travel insurance (restrictions, exclusions (including for pre-existing medical conditions and persons aged 80 years or over), limits, sub-limits and excesses apply)."},{"name":"Awards credit card","desc":"For customers who want a lower annual fee and credit limit, but still like to earn Awards points."},{"name":"Platinum Awards credit card","desc":"A credit card with the opportunity to earn Awards points and take advantage of extras like international travel insurance."},{"name":"Low Rate credit card","desc":"Ideal for small business owners looking for a line of credit with a competitive interest rate and no annual fee. Note, this product does not include an interest free day period."},{"name":"Interest-Free Days credit card","desc":"Designed for those looking for a card with a competitive interest-free period to help with business cash flow."},{"name":"Business Awards credit card","desc":"Perfect for those looking for a competitive interest-free period on purchases and to reward themselves for business purchases."},{"name":"Business Platinum Awards credit card","desc":"Earn 1 Awards point for every dollar you spend on your business expenses."},{"name":"CommBank Essentials credit card","desc":"A simple card with our lowest rate on purchases, helping you stay in control."},{"name":"Ultimate Awards credit card","desc":"Our most rewarding credit card with uncapped points earning potential, exclusive travel benefits and no monthly fee for eligible customers."},{"name":"CommBank Neo Card","desc":"It's a new way to pay! An interest-free credit card without any late fees or surprise charges - just a flat monthly fee. Say goodbye to complex percentages and calculations."}]},"size": "21"}