{"data": {"products":[{"name":"Disclaimer !!","desc":"The content of this app is provided for information purposes only.\n\nThe public (open) data available from this app is intended as a general reference source. Users are encouraged to check with the individual bank to make any financial decision.\n\nThe Developer of the app does not guarantee, and accepts no legal liability whatsoever arising from, or connected to, the use of any material contained in this app."},{"name":"NAB - Product's !\nTrans And Savings Accounts","desc":"Thank you for using `my Bank-AU` app.\n\nThis data was last updated on : Apr 25, 2021\n\nTo know more about open banking in Australia, visit:\n\nhttps://treasury.gov.au/consumer-data-right"},{"name":"NAB Wealth Builder","desc":"The NAB Wealth Builder is a savings account designed for easy ongoing management of your deposits, making it simpler to achieve savings goals, subject to committing to a notice period for withdrawals."},{"name":"NAB Retirement Account","desc":"Get more from your money in retirement and enjoy easy access to your money while earning a competitive interest rate."},{"name":"NAB Business Everyday Account ($10 monthly fee)","desc":"Get greater certainty of your costs with a flat monthly fee."},{"name":"NAB Farm Management Account","desc":"A transaction account for rural producers and farming businesses."},{"name":"NAB Business Interest Account","desc":"A transaction account suitable for customers who maintain a high account balance and low transaction volume. Earn interest on a tiered basis on every dollar."},{"name":"NAB Reward Saver","desc":"Grow your savings faster with bonus interest for regular deposits and no withdrawals."},{"name":"NAB Professional Funds Account","desc":"An 'at call', interest bearing deposit account for investors with at least $500,000 to invest."},{"name":"NAB Corporate Cheque Account","desc":"A transaction account for Corporate, Institutional and large business customers."},{"name":"NAB iSaver","desc":"Access your savings whenever you need them, without affecting your interest rate."},{"name":"NAB Community Fee Saver","desc":"A transaction account for your not-for-profit organisation or community group."},{"name":"NAB Foreign Currency Account","desc":"A transaction account designed for customers who frequently make or receive payments in a foreign currency."},{"name":"NAB Cash Manager Account","desc":"Manage your investment cash flows with an investment-friendly transaction account"},{"name":"Business Cash Maximiser","desc":"An online savings account earning interest on every dollar when your balance is $10,000 or more."},{"name":"NAB Business Everyday Account ($0 monthly fee)","desc":"Embrace the flexibility of only paying for what you need"},{"name":"NAB Classic Banking Account","desc":"Meet your everyday bank account. Easy access to your money with no monthly account fees."}]},"size": "17"}