{
  "data": {
  "products":[
  {
    "productId": "Last Screen",
    "name": "Disclaimer !!",
    "description": "The content of this app is for information purposes only.\n\nThe open data available from this app is for general reference only.\n\nUsers are encouraged to check with the individual bank to make any financial decision.\n\nThe Developer of the app does not guarantee, and accepts no legal liability whatsoever arising from, or connected to, the use of any material contained in this app.",
    "category": "Type of Products"
  },
  {
    "productId": "DELETE IT .......",
    "name": "Standard Business Cheque Account - Interest Bearing Option",
    "description": "A transaction account to make or receive payments in a foreign currency and/or  hold a foreign currency balance. Available in a range of foreign currencies.\nAvailable currencies are:United States Dollars (USD), Chinese Yuan RMB (CNY), Great Britain Pounds (GBP), Canadian Dollars (CAD), Danish Kroner (DKK), Euro (EUR), Hong Kong Dollars (HKD), Japanese Yen (JPY), New Zealand Dollars (NZD), Norwegian Kroner (NOK), Singapore Dollars (SGD), Swedish Kronor (SEK), Swiss Francs (CHF), Thailand Baht (THB), South African Rand (ZAR).\nThings you should know:This information does not take your personal objectives, circumstances or needs into account. Consider its appropriateness to these factors before acting on it. Read the disclosure documents for this product, including the Foreign Currency Account Terms & Conditions, International Products and Services Standard Fees and Online Banking Terms and Conditions, before deciding. This product is only available in Australia from Westpac Banking Corporation ABN 33 007 457 141 AFSL and Australian credit licence 233714.\nA Foreign Currency Account should not be used to speculate on foreign currencies or to conduct frequent trading of foreign currencies.A Foreign Currency Account is not an account to assist with travel needs. It cannot be linked to a Travel Money card and you cannot access your Foreign Currency Account through an ATM, either within Australia or overseas.\nYou cannot withdraw or deposit foreign notes or coins into a Foreign Currency Account.Deposits held in Foreign Currency Accounts are not covered by the Australian Government?s Financial Claims Scheme.Credit facilities are subject to application and Westpac's normal lending assessment criteria. Fees and charges may apply to the products and services listed. Full details of the Terms and Conditions for this product can be requested from Westpac.Payments received in a foreign currency require manual reconciliation to reflect the correct invoice status. BPAY is not available for invoices issued in a foreign currency. Payment of FCA invoices can be done using direct deposit via international transfer only.Credit balance fees are only applicable to clients who are determined by Westpac to be wholesale clients as defined under the Corporations Act. If Westpac determines that you are a wholesale client as defined under the Corporations Act, Westpac will notify you before applying a credit balance fee to your Foreign Currency Account.",
    "category": "TRANS_AND_SAVINGS_ACCOUNTS"
  },
  {
    "productId": "Last Screen on APP",
    "name": "CBA Products !\nTransaction & Savings Accounts",
    "description": "Thank you for using `My Bank -AU-9` app.\n\nThis data was last updated on : 12 Apr 2021\n\nTo know more details and background on open banking in Australia, visit:\n\nhttps://treasury.gov.au/consumer-data-right",
    "category": "Type of Accounts"
  },
  {
    "productId": "ad22b1f0967349e8a5d586afe7f0d845",
    "name": "NetBank Saver",
    "description": "An online savings account with the flexibility to move money in and out of your linked CommBank transaction account using NetBank or the CommBank app.",
    "category": "TRANS_AND_SAVINGS_ACCOUNTS"
  },
  {
    "productId": "7aff9e0e85e6450eb052d4ff2e953223",
    "name": "Youthsaver Account",
    "description": "Designed to help teach saving skills to under 18s, our Youthsaver account offers bonus interest for reaching saving goals.",
    "category": "TRANS_AND_SAVINGS_ACCOUNTS"
  },
  {
    "productId": "72f214498c7f47a98fe59b794e7c01ab",
    "name": "GoalSaver",
    "description": "Be rewarded with a variable bonus interest rate for saving regularly each month.",
    "category": "TRANS_AND_SAVINGS_ACCOUNTS"
  },
  {
    "productId": "7375f63775b4489a890655e25395e12d",
    "name": "Pensioner Security",
    "description": "A flexible account that keeps your retirement savings or pension income safe and working for you.",
    "category": "TRANS_AND_SAVINGS_ACCOUNTS"
  },
  {
    "productId": "33557e367d324529b38813adfc655b55",
    "name": "Smart Access",
    "description": "An everyday bank account, giving you access to unlimited electronic transactions and features to help your spending and bills stay on track. Plus if you meet certain criteria, we'll waive your $4 monthly account fee.",
    "category": "TRANS_AND_SAVINGS_ACCOUNTS"
  },
  {
    "productId": "5921439d2525442da3841a25572a740e",
    "name": "Streamline Basic",
    "description": "An everyday bank account for health care or pensioner concession card holders.",
    "category": "TRANS_AND_SAVINGS_ACCOUNTS"
  },
  {
    "productId": "c50f2a2cf77c47248ebbb565d2d6c1cb",
    "name": "Private Bank Account",
    "description": "The Commonwealth Private Bank Account is an exclusive transaction account for Commonwealth Private clients.",
    "category": "TRANS_AND_SAVINGS_ACCOUNTS"
  },
  {
    "productId": "f70238d4ee324ad99af6ee0f01f7cdde",
    "name": "Business Transaction Account",
    "description": "An everyday business bank account that you can open online, which provides unlimited electronic transactions and 20 assisted transactions on a monthly basis for customers on the $10 monthly account fee pricing option. Fees and charges will apply if you exceed this amount. Customers with the $0 monthly account fee pricing option will not have included assisted transactions - each assisted transaction will be chargeable. Please note Access, CommBiz and NetBank Service Fees may apply and are excluded from the unlimited electronic transactions.",
    "category": "TRANS_AND_SAVINGS_ACCOUNTS"
  },
  {
    "productId": "b31f8ddfc16b4121a0522fdc4af6cf7e",
    "name": "Business Online Saver",
    "description": "A business savings account that can help you manage cash flow and set aside money for tax payments.",
    "category": "TRANS_AND_SAVINGS_ACCOUNTS"
  },
  {
    "productId": "07546f4ac1d4455d8dd2f3954d33ca68",
    "name": "Standard Business Cheque Account - Interest Bearing Option",
    "description": "Transaction accounts that pays interest above minimum balances.",
    "category": "TRANS_AND_SAVINGS_ACCOUNTS"
  },
  {
    "productId": "ed65bdaefe1d4b2d83cdcd384c9d582d",
    "name": "Everyday Offset",
    "description": "Everyday Offset is a feature of our Complete Access Transaction account which is linked to an eligible home loan, and account holder(s) must also be account holders of the linked home loan. Interest is not charged on the part of the Home Loan balance equal to the Transaction account. Full terms and conditions for transaction and savings accounts are available at CommBank.com.au or from any branch of the Commonwealth Bank. Fees and charges apply.",
    "category": "TRANS_AND_SAVINGS_ACCOUNTS"
  },
  {
    "productId": "e78c63efd0f64a32a9db0899e2caf301",
    "name": "Society cheque account",
    "description": "A transaction account for eligible not-for-profit and community organisations. You can set one up in any of our branches.",
    "category": "TRANS_AND_SAVINGS_ACCOUNTS"
  },
  {
    "productId": "8bba7e425a5a4eeb8ecb7eec4daadf0c",
    "name": "Foreign Currency Account (Retail)",
    "description": "Make and receive payments in foreign currency. And save on conversion costs.",
    "category": "TRANS_AND_SAVINGS_ACCOUNTS"
  },
  {
    "productId": "b9e5529bf94f46e5a30b1baea8db0df5",
    "name": "Foreign Currency Account (Business)",
    "description": "Make and receive payments easily if your business regularly deals in foreign currencies.",
    "category": "TRANS_AND_SAVINGS_ACCOUNTS"
  },
  {
    "productId": "c50e04c305df4bc9bb045492e3b12d55",
    "name": "Cash Deposit account (At Call)",
    "description": "A choice of investment alternatives within one account with competitive interest rates.",
    "category": "TRANS_AND_SAVINGS_ACCOUNTS"
  },
  {
    "productId": "cea8baa02cca4e0990372984db2b0bf2",
    "name": "Farm Management Deposit account (At Call)",
    "description": "A tax-effective investment that allows primary producers to set aside pre-tax income as a cash reserve for later years.",
    "category": "TRANS_AND_SAVINGS_ACCOUNTS"
  },
  {
    "productId": "da527ba1942246edac4d5da36dbc1da8",
    "name": "Commonwealth Direct Investment Account",
    "description": "A cash management account for investors allowing you to trade and transact when and where it suits you.",
    "category": "TRANS_AND_SAVINGS_ACCOUNTS"
  },
  {
    "productId": "8630158361b240148d6577bb22e5e5f9",
    "name": "Accelerator Cash Account",
    "description": "Safe, simple, powerful cash management for advised investors and Self-Managed Super Funds.",
    "category": "TRANS_AND_SAVINGS_ACCOUNTS"
  }
]},
"size":"20"
}
